In [1]:
import pandas as pd

In [3]:
tria=pd.read_csv('CSV_EX_1.csv',header=None)

In [4]:
trial0=pd.read_csv('CSV_EX_2.csv',header=None)

In [5]:
trial0.head(2)

   0     1      2       3
0  2  1500   Good  300000
1  3  1300   Fair  240000

In [6]:
tria.head()

         0          1           2           3
0  Bedroom   Sq. foot    Locality   Price ($)
1        2       1500        Good      300000
2        3       1300        Fair      240000
3        3       1900   Very good      450000
4        3       1850         Bad      280000

In [8]:
df2=pd.read_csv('CSV_EX_2.csv',header=None,names=['Bedroom','Sq.ft','Locality','Prices($)'])

In [9]:
df2.head()

   Bedroom  Sq.ft    Locality  Prices($)
0        2   1500        Good     300000
1        3   1300        Fair     240000
2        3   1900   Very good     450000
3        3   1850         Bad     280000
4        2   1640        Good     310000

In [11]:
df3=pd.read_csv('CSV_EX_3.csv',sep=';')
df3.head(1)

   Bedroom   Sq. foot  Locality   Price ($)
0        2       1500      Good      300000

In [12]:
df4=pd.read_csv('CSV_EX_1.csv',header=0,names=['A','B','C','D'])
df4.head(2)

   A     B      C       D
0  2  1500   Good  300000
1  3  1300   Fair  240000

In [13]:
df5=pd.read_csv('CSV_EX_skiprows.csv',skiprows=2)
df5.head(2)

   Bedroom   Sq. foot  Locality   Price ($)
0        2       1500      Good      300000
1        3       1300      Fair      240000

In [14]:
d=pd.read_csv('CSV_EX_skiprows.csv')
d.head(2)

  Filetype: CSV              Unnamed: 1 Unnamed: 2  Unnamed: 3
0           NaN  Info about some houses        NaN         NaN
1       Bedroom                Sq. foot   Locality   Price ($)

In [15]:
 df5=pd.read_csv('CSV_EX_skipfooter.csv',skiprows=2,skipfooter=1)
df5.head(2)

<ipython-input-15-f9c1944029bf>:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support skipfooter; you can avoid this warning by specifying engine='python'.
  df5=pd.read_csv('CSV_EX_skipfooter.csv',skiprows=2,skipfooter=1)

   Bedroom   Sq. foot  Locality   Price ($)
0        2       1500      Good      300000
1        3       1300      Fair      240000

In [16]:
df7=pd.read_csv('CSV_EX_1.csv',nrows=2)
df7.head(2)

   Bedroom   Sq. foot  Locality   Price ($)
0        2       1500      Good      300000
1        3       1300      Fair      240000

In [17]:
df9=pd.read_csv('CSV_EX_blankline.csv',skip_blank_lines=False)
df9

   Bedroom   Sq. foot    Locality   Price ($)
0      2.0     1500.0        Good    300000.0
1      3.0     1300.0        Fair    240000.0
2      NaN        NaN         NaN         NaN
3      3.0     1900.0   Very good    450000.0
4      3.0     1850.0         Bad    280000.0
5      NaN        NaN         NaN         NaN
6      2.0     1640.0        Good    310000.0

In [18]:
df10=pd.read_csv('CSV_EX_1.zip')
df10.head(2)

   Bedroom   Sq. foot  Locality   Price ($)
0        2       1500      Good      300000
1        3       1300      Fair      240000

In [19]:
df11=pd.read_csv('trythis.zip')
df11.head(2)

   Bedroom   Sq. foot  Locality   Price ($)
0        2       1500      Good      300000
1        3       1300      Fair      240000

In [20]:
list1=[]
rows=10
chunksof=5
df=pd.read_csv('CSV_EX_1.csv')

In [26]:
dd=pd.read_csv('red.csv',sep=';')
a,b=dd.shape

In [24]:
a

1599

In [25]:
b

1

In [27]:
b

12

In [32]:
dd.datatype()

AttributeError: 'DataFrame' object has no attribute 'datatype'

In [30]:
dd.describe()

,fixed acidity,volatile acidity,citric acid,residual sugar,chlorides,free sulfur dioxide,total sulfur dioxide,density,pH,sulphates,alcohol,quality
count,1599.000000,1599.000000,1599.000000,1599.000000,1599.000000,1599.000000,1599.000000,1599.000000,1599.000000,1599.000000,1599.000000,1599.000000
mean,8.319637,0.527821,0.270976,2.538806,0.087467,15.874922,46.467792,0.996747,3.311113,0.658149,10.422983,5.636023
std,1.741096,0.179060,0.194801,1.409928,0.047065,10.460157,32.895324,0.001887,0.154386,0.169507,1.065668,0.807569
min,4.600000,0.120000,0.000000,0.900000,0.012000,1.000000,6.000000,0.990070,2.740000,0.330000,8.400000,3.000000
25%,7.100000,0.390000,0.090000,1.900000,0.070000,7.000000,22.000000,0.995600,3.210000,0.550000,9.500000,5.000000
50%,7.900000,0.520000,0.260000,2.200000,0.079000,14.000000,38.000000,0.996750,3.310000,0.620000,10.200000,6.000000
75%,9.200000,0.640000,0.420000,2.600000,0.090000,21.000000,62.000000,0.997835,3.400000,0.730000,11.100000,6.000000
max,15.900000,1.580000,1.000000,15.500000,0.611000,72.000000,289.000000,1.003690,4.010000,2.000000,14.900000,8.000000

In [33]:
dd.head(1)

,fixed acidity,volatile acidity,citric acid,residual sugar,chlorides,free sulfur dioxide,total sulfur dioxide,density,pH,sulphates,alcohol,quality
0,7.4,0.7,0.0,1.9,0.076,11.0,34.0,0.9978,3.51,0.56,9.4,5

In [36]:
dd['pH'].value_counts()

3.30    57
3.36    56
3.26    53
3.38    48
3.39    48
        ..
2.95     1
3.74     1
2.87     1
2.90     1
3.70     1
Name: pH, Length: 89, dtype: int64